Full `common` module TF plan:
```hcl
Terraform will perform the following actions:

  # aws_kms_key.notification-canada-ca-us-east-1 will be created
  + resource "aws_kms_key" "notification-canada-ca-us-east-1" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "notification-canada-ca production encryption key in us-east-1"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "key-default-us-east-1"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::296255494825:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "cloudwatch.amazonaws.com",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Allow_CloudWatch_for_CMK"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Name"       = "notification-canada-ca"
        }
      + tags_all                           = {
          + "CostCenter" = "notification-canada-ca-production"
          + "Name"       = "notification-canada-ca"
        }
    }

  # aws_lambda_permission.sns_critical_us_east_1_to_slack_lambda will be created
  + resource "aws_lambda_permission" "sns_critical_us_east_1_to_slack_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-critical"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

  # aws_lambda_permission.sns_ok_us_east_1_to_slack_lambda will be created
  + resource "aws_lambda_permission" "sns_ok_us_east_1_to_slack_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-ok"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

  # aws_lambda_permission.sns_warning_us_east_1_to_slack_lambda will be created
  + resource "aws_lambda_permission" "sns_warning_us_east_1_to_slack_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-warning"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

  # aws_sns_topic.notification-canada-ca-alert-critical-us-east-1 will be created
  + resource "aws_sns_topic" "notification-canada-ca-alert-critical-us-east-1" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "alert-critical-us-east-1"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-production"
        }
    }

  # aws_sns_topic.notification-canada-ca-alert-ok-us-east-1 will be created
  + resource "aws_sns_topic" "notification-canada-ca-alert-ok-us-east-1" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "alert-ok-us-east-1"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-production"
        }
    }

  # aws_sns_topic.notification-canada-ca-alert-warning-us-east-1 will be created
  + resource "aws_sns_topic" "notification-canada-ca-alert-warning-us-east-1" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "alert-warning-us-east-1"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-production"
        }
    }

  # aws_sns_topic_subscription.alert_critical_us_east_1_to_opsgenie[0] will be created
  + resource "aws_sns_topic_subscription" "alert_critical_us_east_1_to_opsgenie" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive)
      + endpoint_auto_confirms          = true
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.alert_critical_us_east_1_to_opsgenie_ok[0] will be created
  + resource "aws_sns_topic_subscription" "alert_critical_us_east_1_to_opsgenie_ok" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive)
      + endpoint_auto_confirms          = true
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.sns_alert_critical_us_east_1_to_lambda will be created
  + resource "aws_sns_topic_subscription" "sns_alert_critical_us_east_1_to_lambda" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-critical"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.sns_alert_ok_us_east_1_to_lambda will be created
  + resource "aws_sns_topic_subscription" "sns_alert_ok_us_east_1_to_lambda" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-ok"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.sns_alert_warning_us_east_1_to_lambda will be created
  + resource "aws_sns_topic_subscription" "sns_alert_warning_us_east_1_to_lambda" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-warning"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.notify_slack_critical.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      ~ account_id = "296255494825" -> (known after apply)
      ~ arn        = "arn:aws:iam::296255494825:user/notification-production-tf-user" -> (known after apply)
      ~ id         = "296255494825" -> (known after apply)
      ~ user_id    = "AIDAUJ6RUDKUUCZFM7MQB" -> (known after apply)
    }

  # module.notify_slack_critical.data.aws_iam_policy_document.lambda[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda"  {
      ~ id      = "1046718055" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-critical:*"
                      - Sid      = "AllowWriteToCloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.notify_slack_critical.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.notify_slack_critical.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      ~ description = "Canada (Central)" -> (known after apply)
      ~ endpoint    = "ec2.ca-central-1.amazonaws.com" -> (known after apply)
      ~ id          = "ca-central-1" -> (known after apply)
      ~ name        = "ca-central-1" -> (known after apply)
    }

  # module.notify_slack_critical.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
      ~ arn                             = "arn:aws:sns:ca-central-1:296255494825:alert-critical:9d54e1ce-4afb-4579-8bf3-82dd395097f5" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:296255494825:alert-critical:9d54e1ce-4afb-4579-8bf3-82dd395097f5" -> (known after apply)
      ~ owner_id                        = "296255494825" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:ca-central-1:296255494825:alert-critical" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_ok.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      ~ account_id = "296255494825" -> (known after apply)
      ~ arn        = "arn:aws:iam::296255494825:user/notification-production-tf-user" -> (known after apply)
      ~ id         = "296255494825" -> (known after apply)
      ~ user_id    = "AIDAUJ6RUDKUUCZFM7MQB" -> (known after apply)
    }

  # module.notify_slack_ok.data.aws_iam_policy_document.lambda[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda"  {
      ~ id      = "2516871417" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-ok:*"
                      - Sid      = "AllowWriteToCloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.notify_slack_ok.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.notify_slack_ok.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      ~ description = "Canada (Central)" -> (known after apply)
      ~ endpoint    = "ec2.ca-central-1.amazonaws.com" -> (known after apply)
      ~ id          = "ca-central-1" -> (known after apply)
      ~ name        = "ca-central-1" -> (known after apply)
    }

  # module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
      ~ arn                             = "arn:aws:sns:ca-central-1:296255494825:alert-ok:489a9827-5acf-4e08-a629-7841b7973c7e" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:296255494825:alert-ok:489a9827-5acf-4e08-a629-7841b7973c7e" -> (known after apply)
      ~ owner_id                        = "296255494825" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:ca-central-1:296255494825:alert-ok" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_warning.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      ~ account_id = "296255494825" -> (known after apply)
      ~ arn        = "arn:aws:iam::296255494825:user/notification-production-tf-user" -> (known after apply)
      ~ id         = "296255494825" -> (known after apply)
      ~ user_id    = "AIDAUJ6RUDKUUCZFM7MQB" -> (known after apply)
    }

  # module.notify_slack_warning.data.aws_iam_policy_document.lambda[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda"  {
      ~ id      = "1759620119" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-warning:*"
                      - Sid      = "AllowWriteToCloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.notify_slack_warning.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.notify_slack_warning.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      ~ description = "Canada (Central)" -> (known after apply)
      ~ endpoint    = "ec2.ca-central-1.amazonaws.com" -> (known after apply)
      ~ id          = "ca-central-1" -> (known after apply)
      ~ name        = "ca-central-1" -> (known after apply)
    }

  # module.notify_slack_warning.aws_sns_topic_subscription.sns_notify_slack[0] must be replaced
-/+ resource "aws_sns_topic_subscription" "sns_notify_slack" {
      ~ arn                             = "arn:aws:sns:ca-central-1:296255494825:alert-warning:94eaf84e-3c37-4d8b-b115-2c46dccf09d4" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:296255494825:alert-warning:94eaf84e-3c37-4d8b-b115-2c46dccf09d4" -> (known after apply)
      ~ owner_id                        = "296255494825" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:ca-central-1:296255494825:alert-warning" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.notify_slack_critical.module.lambda.data.aws_cloudwatch_log_group.lambda[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_cloudwatch_log_group" "lambda"  {
      ~ arn               = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-critical:*" -> (known after apply)
      ~ creation_time     = 1605714400384 -> (known after apply)
      ~ id                = "/aws/lambda/notify-slack-critical" -> (known after apply)
      + kms_key_id        = (known after apply)
        name              = "/aws/lambda/notify-slack-critical"
      ~ retention_in_days = 90 -> (known after apply)
      ~ tags              = {} -> (known after apply)
    }

  # module.notify_slack_critical.module.lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.notify_slack_critical.module.lambda.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.notify_slack_critical.module.lambda.data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
            # (7 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/notify_slack_critical/functions/notify_slack.py",
                          - null,
                        ],
                    ]
                  - filename      = "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.zip"
                  - runtime       = "python3.8"
                }
            )
          - "build_plan_filename" = "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.plan.json"
          - "filename"            = "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.zip"
          - "timestamp"           = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
          - "was_missing"         = "false"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::296255494825:policy/lambda-notify-slack-critical"
        name      = "lambda-notify-slack-critical"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-critical:*"
                      - Sid      = "AllowWriteToCloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "lambda-notify-slack-critical"
        name                  = "lambda-notify-slack-critical"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.zip" -> (known after apply)
        id                             = "notify-slack-critical"
      ~ last_modified                  = "2021-12-13T15:57:56.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-critical:6" -> (known after apply)
      ~ source_code_hash               = "zAjQdFxDkd/pMveNgnQjfi5pDF8nFGOPumbUMRT7lyA=" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier     = "6" -> (known after apply) # forces replacement
      ~ source_arn    = "arn:aws:sns:ca-central-1:296255494825:alert-critical" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
      ~ source_arn    = "arn:aws:sns:ca-central-1:296255494825:alert-critical" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack_critical.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.notify_slack_critical.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1411111759874821198" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/68444775d75c3fa773d9537dce0b6534b2d31477bb78f36cb44a09ee16cdc3f1.zip"
          - "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        } -> (known after apply) # forces replacement
    }

  # module.notify_slack_ok.module.lambda.data.aws_cloudwatch_log_group.lambda[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_cloudwatch_log_group" "lambda"  {
      ~ arn               = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-ok:*" -> (known after apply)
      ~ creation_time     = 1646852187638 -> (known after apply)
      ~ id                = "/aws/lambda/notify-slack-ok" -> (known after apply)
      + kms_key_id        = (known after apply)
        name              = "/aws/lambda/notify-slack-ok"
      ~ retention_in_days = 90 -> (known after apply)
      ~ tags              = {} -> (known after apply)
    }

  # module.notify_slack_ok.module.lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.notify_slack_ok.module.lambda.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.notify_slack_ok.module.lambda.data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
            # (7 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/notify_slack_ok/functions/notify_slack.py",
                          - null,
                        ],
                    ]
                  - filename      = "builds/9b5dda4d6aef364170d47200ab4ce3c1ccceca2124ebf7cb48eab50e28bb[456](https://github.com/cds-snc/notification-terraform/actions/runs/3960540945/jobs/6784828415#step:6:457)0.zip"
                  - runtime       = "python3.8"
                }
            )
          - "build_plan_filename" = "builds/9b5dda4d6aef364170d47200ab4ce3c1ccceca2124ebf7cb48eab50e28bb4560.plan.json"
          - "filename"            = "builds/9b5dda4d6aef364170d47200ab4ce3c1ccceca2124ebf7cb48eab50e28bb4560.zip"
          - "timestamp"           = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
          - "was_missing"         = "false"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::296255494825:policy/lambda-notify-slack-ok"
        name      = "lambda-notify-slack-ok"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-ok:*"
                      - Sid      = "AllowWriteToCloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "lambda-notify-slack-ok"
        name                  = "lambda-notify-slack-ok"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/9b5dda4d6aef364170d47200ab4ce3c1ccceca2124ebf7cb48eab50e28bb4560.zip" -> (known after apply)
        id                             = "notify-slack-ok"
      ~ last_modified                  = "2022-03-09T18:56:45.[460](https://github.com/cds-snc/notification-terraform/actions/runs/3960540945/jobs/6784828415#step:6:461)+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-ok:1" -> (known after apply)
      ~ source_code_hash               = "xZ6TZcb4wEFYuvwuAU8NtguC1aB9CUg1neEAUrpWn38=" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier     = "1" -> (known after apply) # forces replacement
      ~ source_arn    = "arn:aws:sns:ca-central-1:296255494825:alert-ok" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
      ~ source_arn    = "arn:aws:sns:ca-central-1:296255494825:alert-ok" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack_ok.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5597754256105813774" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/9b5dda4d6aef364170d47200ab4ce3c1ccceca2124ebf7cb48eab50e28bb4560.zip"
          - "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        } -> (known after apply) # forces replacement
    }

  # module.notify_slack_warning.module.lambda.data.aws_cloudwatch_log_group.lambda[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_cloudwatch_log_group" "lambda"  {
      ~ arn               = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-warning:*" -> (known after apply)
      ~ creation_time     = 1605714400726 -> (known after apply)
      ~ id                = "/aws/lambda/notify-slack-warning" -> (known after apply)
      + kms_key_id        = (known after apply)
        name              = "/aws/lambda/notify-slack-warning"
      ~ retention_in_days = 90 -> (known after apply)
      ~ tags              = {} -> (known after apply)
    }

  # module.notify_slack_warning.module.lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.notify_slack_warning.module.lambda.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.notify_slack_warning.module.lambda.data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
            # (7 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/notify_slack_warning/functions/notify_slack.py",
                          - null,
                        ],
                    ]
                  - filename      = "builds/8d55fd6785ead0e3332405256a36c04867b93585e586c3960dcc5d36f5f5c84b.zip"
                  - runtime       = "python3.8"
                }
            )
          - "build_plan_filename" = "builds/8d55fd6785ead0e3332405256a36c04867b93585e586c3960dcc5d36f5f5c84b.plan.json"
          - "filename"            = "builds/8d55fd6785ead0e3332405256a36c04867b93585e586c3960dcc5d36f5f5c84b.zip"
          - "timestamp"           = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
          - "was_missing"         = "false"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::296255494825:policy/lambda-notify-slack-warning"
        name      = "lambda-notify-slack-warning"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:296255494825:log-group:/aws/lambda/notify-slack-warning:*"
                      - Sid      = "AllowWriteToCloudwatchLogs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "lambda-notify-slack-warning"
        name                  = "lambda-notify-slack-warning"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/8d55fd6785ead0e3332405256a36c04867b93585e586c3960dcc5d36f5f5c84b.zip" -> (known after apply)
        id                             = "notify-slack-warning"
      ~ last_modified                  = "2021-12-13T15:58:02.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:296255494825:function:notify-slack-warning:6" -> (known after apply)
      ~ source_code_hash               = "zAjQdFxDkd/pMveNgnQjfi5pDF8nFGOPumbUMRT7lyA=" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (21 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
      ~ qualifier     = "6" -> (known after apply) # forces replacement
      ~ source_arn    = "arn:aws:sns:ca-central-1:296255494825:alert-warning" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromSNS"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
      ~ id            = "AllowExecutionFromSNS" -> (known after apply)
      ~ source_arn    = "arn:aws:sns:ca-central-1:296255494825:alert-warning" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack_warning.module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.notify_slack_warning.module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2[473](https://github.com/cds-snc/notification-terraform/actions/runs/3960540945/jobs/6784828415#step:6:474)965109639399552" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/8d55fd6785ead0e3332405256a36c0[486](https://github.com/cds-snc/notification-terraform/actions/runs/3960540945/jobs/6784828415#step:6:487)7b93585e586c3960dcc5d36f5f5c84b.zip"
          - "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        } -> (known after apply) # forces replacement
    }

Plan: 27 to add, 9 to change, 12 to destroy.

Changes to Outputs:
  + sns_alert_critical_arn_us_east_1 = (known after apply)
  + sns_alert_ok_arn_us_east_1       = (known after apply)
  + sns_alert_warning_arn_us_east_1  = (known after apply)
```